


# **DRIVE ACCESS AUTHENTICATION**

In [149]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

# **IMPORTING PACKAGES**

In [150]:
import pandas as pd
import numpy as np

# **READING THE DATASET**

In [151]:
df = pd.read_csv('/content/drive/MyDrive/TRF/data.csv')

# **DATA PREPROCESSING**

In [152]:
df

     passenger_id  pclass  ...                 home.dest survived
0            1216       3  ...                       NaN        1
1             699       3  ...                   Croatia        0
2            1267       3  ...                       NaN        0
3             449       2  ...      Cornwall / Akron, OH        1
4             576       2  ...  Barre, Co Washington, VT        0
..            ...     ...  ...                       ...      ...
845           158       1  ...       London / Birmingham        0
846           174       1  ...               Buffalo, NY        0
847           467       2  ...        Moscow / Bronx, NY        1
848          1112       3  ...                       NaN        0
849           425       2  ...                 Bronx, NY        0

[850 rows x 15 columns]

**DATA CLEANING AND REMOVING THE NULL VALUES**

In [153]:
df.isnull().sum()

passenger_id      0
pclass            0
name              0
sex               0
age             174
sibsp             0
parch             0
ticket            0
fare              1
cabin           659
embarked          1
boat            542
body            777
home.dest       386
survived          0
dtype: int64

In [154]:
df['age'].count()

676

In [155]:
df['cabin'].count()

191

In [156]:
df['boat'].count()

308

In [157]:
df['body'].count()

73

In [158]:
df['home.dest'].count()

464

In [159]:
df.drop(labels = {'body','cabin','home.dest','boat','name','ticket'} , axis = 1 , inplace = True)

In [160]:
df

     passenger_id  pclass     sex   age  ...  parch     fare  embarked survived
0            1216       3  female   NaN  ...      0   7.7333         Q        1
1             699       3    male  38.0  ...      0   8.6625         S        0
2            1267       3  female  30.0  ...      1  24.1500         S        0
3             449       2  female  54.0  ...      3  23.0000         S        1
4             576       2    male  40.0  ...      0  13.0000         S        0
..            ...     ...     ...   ...  ...    ...      ...       ...      ...
845           158       1    male  55.0  ...      0  50.0000         S        0
846           174       1    male  58.0  ...      0  29.7000         C        0
847           467       2  female  24.0  ...      0  26.0000         S        1
848          1112       3  female   3.0  ...      1  13.7750         S        0
849           425       2    male  52.0  ...      0  13.0000         S        0

[850 rows x 9 columns]

In [161]:
df.isnull().sum()

passenger_id      0
pclass            0
sex               0
age             174
sibsp             0
parch             0
fare              1
embarked          1
survived          0
dtype: int64

In [162]:
new_df = df.dropna()
new_df

     passenger_id  pclass     sex   age  ...  parch     fare  embarked survived
1             699       3    male  38.0  ...      0   8.6625         S        0
2            1267       3  female  30.0  ...      1  24.1500         S        0
3             449       2  female  54.0  ...      3  23.0000         S        1
4             576       2    male  40.0  ...      0  13.0000         S        0
5            1083       3    male  28.0  ...      0  22.5250         S        0
..            ...     ...     ...   ...  ...    ...      ...       ...      ...
845           158       1    male  55.0  ...      0  50.0000         S        0
846           174       1    male  58.0  ...      0  29.7000         C        0
847           467       2  female  24.0  ...      0  26.0000         S        1
848          1112       3  female   3.0  ...      1  13.7750         S        0
849           425       2    male  52.0  ...      0  13.0000         S        0

[674 rows x 9 columns]

In [163]:
new_df.isnull().sum()

passenger_id    0
pclass          0
sex             0
age             0
sibsp           0
parch           0
fare            0
embarked        0
survived        0
dtype: int64

In [164]:
new_df.shape

(674, 9)

In [165]:
df.isnull().sum()

passenger_id      0
pclass            0
sex               0
age             174
sibsp             0
parch             0
fare              1
embarked          1
survived          0
dtype: int64

In [166]:
df = df.dropna(subset = ['fare','embarked'])

In [167]:
df.isnull().sum()

passenger_id      0
pclass            0
sex               0
age             174
sibsp             0
parch             0
fare              0
embarked          0
survived          0
dtype: int64

**REPLACING THE NULL VALUES WITH MEAN OR MEDIAN VALUES**

In [168]:
cols_null = ['age']
median = []

# loop for obtaining the median
for i in cols_null: 
  median.append(df[i].median())  

print("Median Value : " , median[0])

k = 0 

# loop for replacing null values 
for i in cols_null:
  df[i].fillna(median[k] , inplace = True)    # fillna fills the null values 
  k = k + 1

Median Value :  28.0

/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:4536: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  downcast=downcast,

In [169]:
df.isnull().sum()

passenger_id    0
pclass          0
sex             0
age             0
sibsp           0
parch           0
fare            0
embarked        0
survived        0
dtype: int64

**NORMAILZATION OF THE REQUIRED COLUMNS**

In [170]:
df

     passenger_id  pclass     sex   age  ...  parch     fare  embarked survived
0            1216       3  female  28.0  ...      0   7.7333         Q        1
1             699       3    male  38.0  ...      0   8.6625         S        0
2            1267       3  female  30.0  ...      1  24.1500         S        0
3             449       2  female  54.0  ...      3  23.0000         S        1
4             576       2    male  40.0  ...      0  13.0000         S        0
..            ...     ...     ...   ...  ...    ...      ...       ...      ...
845           158       1    male  55.0  ...      0  50.0000         S        0
846           174       1    male  58.0  ...      0  29.7000         C        0
847           467       2  female  24.0  ...      0  26.0000         S        1
848          1112       3  female   3.0  ...      1  13.7750         S        0
849           425       2    male  52.0  ...      0  13.0000         S        0

[848 rows x 9 columns]

In [171]:
cols_to_normalize = ['age','fare']

# Find the maximum and minimum values
max = []
min = []

# loop for getting the max and min of each column 
for i in cols_to_normalize : 
  max.append(df[i].max())

for i in cols_to_normalize:
  min.append(df[i].min())

print("max = ",max,"min = ",min)

k = 0 

# loop for normalizing the column values 
for i in cols_to_normalize : 
  df[i] = (df[i] - min[k])/(max[k] - min[k])
  k = k + 1

max =  [80.0, 512.3292] min =  [0.1667, 0.0]

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:20: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [172]:
df

     passenger_id  pclass     sex       age  ...  parch      fare  embarked survived
0            1216       3  female  0.348643  ...      0  0.015094         Q        1
1             699       3    male  0.473904  ...      0  0.016908         S        0
2            1267       3  female  0.373695  ...      1  0.047138         S        0
3             449       2  female  0.674321  ...      3  0.044893         S        1
4             576       2    male  0.498956  ...      0  0.025374         S        0
..            ...     ...     ...       ...  ...    ...       ...       ...      ...
845           158       1    male  0.686847  ...      0  0.097594         S        0
846           174       1    male  0.724426  ...      0  0.057971         C        0
847           467       2  female  0.298538  ...      0  0.050749         S        1
848          1112       3  female  0.035490  ...      1  0.026887         S        0
849           425       2    male  0.649269  ...      0  0.025374         S        0

[848 rows x 9 columns]

**ENCODING**

In [173]:
# Implement Sklearn label encoding on df
from sklearn import preprocessing

In [174]:
# for sex determination
Lable_Encoder = preprocessing.LabelEncoder()

In [175]:
df['sex'] = Lable_Encoder.fit_transform(df['sex'])

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [176]:
df['sex'].unique()

array([0, 1])

In [177]:
df

     passenger_id  pclass  sex       age  ...  parch      fare  embarked survived
0            1216       3    0  0.348643  ...      0  0.015094         Q        1
1             699       3    1  0.473904  ...      0  0.016908         S        0
2            1267       3    0  0.373695  ...      1  0.047138         S        0
3             449       2    0  0.674321  ...      3  0.044893         S        1
4             576       2    1  0.498956  ...      0  0.025374         S        0
..            ...     ...  ...       ...  ...    ...       ...       ...      ...
845           158       1    1  0.686847  ...      0  0.097594         S        0
846           174       1    1  0.724426  ...      0  0.057971         C        0
847           467       2    0  0.298538  ...      0  0.050749         S        1
848          1112       3    0  0.035490  ...      1  0.026887         S        0
849           425       2    1  0.649269  ...      0  0.025374         S        0

[848 rows x 9 columns]

In [178]:
# for pclass
df['pclass'] = Lable_Encoder.fit_transform(df['pclass'])

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [179]:
df['pclass'].unique()

array([2, 1, 0])

In [180]:
df

     passenger_id  pclass  sex       age  ...  parch      fare  embarked survived
0            1216       2    0  0.348643  ...      0  0.015094         Q        1
1             699       2    1  0.473904  ...      0  0.016908         S        0
2            1267       2    0  0.373695  ...      1  0.047138         S        0
3             449       1    0  0.674321  ...      3  0.044893         S        1
4             576       1    1  0.498956  ...      0  0.025374         S        0
..            ...     ...  ...       ...  ...    ...       ...       ...      ...
845           158       0    1  0.686847  ...      0  0.097594         S        0
846           174       0    1  0.724426  ...      0  0.057971         C        0
847           467       1    0  0.298538  ...      0  0.050749         S        1
848          1112       2    0  0.035490  ...      1  0.026887         S        0
849           425       1    1  0.649269  ...      0  0.025374         S        0

[848 rows x 9 columns]

In [181]:
# for embarked
df['embarked'] = Lable_Encoder.fit_transform(df['embarked'])

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [182]:
df['embarked'].unique()

array([1, 2, 0])

In [183]:
df

     passenger_id  pclass  sex       age  ...  parch      fare  embarked  survived
0            1216       2    0  0.348643  ...      0  0.015094         1         1
1             699       2    1  0.473904  ...      0  0.016908         2         0
2            1267       2    0  0.373695  ...      1  0.047138         2         0
3             449       1    0  0.674321  ...      3  0.044893         2         1
4             576       1    1  0.498956  ...      0  0.025374         2         0
..            ...     ...  ...       ...  ...    ...       ...       ...       ...
845           158       0    1  0.686847  ...      0  0.097594         2         0
846           174       0    1  0.724426  ...      0  0.057971         0         0
847           467       1    0  0.298538  ...      0  0.050749         2         1
848          1112       2    0  0.035490  ...      1  0.026887         2         0
849           425       1    1  0.649269  ...      0  0.025374         2         0

[848 rows x 9 columns]

In [184]:
df.corr()

              passenger_id    pclass       sex  ...      fare  embarked  survived
passenger_id      1.000000  0.896404  0.139459  ... -0.479385  0.133703 -0.303497
pclass            0.896404  1.000000  0.149197  ... -0.560355  0.203509 -0.327250
sex               0.139459  0.149197  1.000000  ... -0.182020  0.072045 -0.508923
age              -0.312397 -0.379626  0.027629  ...  0.194672 -0.072590 -0.032685
sibsp             0.099346  0.074151 -0.124274  ...  0.142352  0.091365 -0.044749
parch            -0.000101 -0.006794 -0.170664  ...  0.246988  0.060980  0.059546
fare             -0.479385 -0.560355 -0.182020  ...  1.000000 -0.255033  0.250287
embarked          0.133703  0.203509  0.072045  ... -0.255033  1.000000 -0.151700
survived         -0.303497 -0.327250 -0.508923  ...  0.250287 -0.151700  1.000000

[9 rows x 9 columns]

# **MODEL IMPLEMENTATION**

**TRAIN TEST SPLIT**

In [185]:
from sklearn import model_selection

In [186]:
# separates target variable from the rest of the features 
X = df.drop('survived' , axis = 1) 
Y = df['survived']

In [187]:
X

     passenger_id  pclass  sex       age  sibsp  parch      fare  embarked
0            1216       2    0  0.348643      0      0  0.015094         1
1             699       2    1  0.473904      0      0  0.016908         2
2            1267       2    0  0.373695      1      1  0.047138         2
3             449       1    0  0.674321      1      3  0.044893         2
4             576       1    1  0.498956      0      0  0.025374         2
..            ...     ...  ...       ...    ...    ...       ...       ...
845           158       0    1  0.686847      0      0  0.097594         2
846           174       0    1  0.724426      0      0  0.057971         0
847           467       1    0  0.298538      1      0  0.050749         2
848          1112       2    0  0.035490      1      1  0.026887         2
849           425       1    1  0.649269      0      0  0.025374         2

[848 rows x 8 columns]

In [188]:
Y

0      1
1      0
2      0
3      1
4      0
      ..
845    0
846    0
847    1
848    0
849    0
Name: survived, Length: 848, dtype: int64

In [189]:
# For training the model we divide the data into training data and testing data
# for that we use train_test_split function

X_train, X_test, Y_train, Y_test = model_selection.train_test_split(X, Y, test_size = 0.3, random_state = 0, stratify=Y )

In [191]:
X_train.shape

(593, 8)

In [192]:
Y_train.shape

(593,)

In [193]:
X_test.shape

(255, 8)

In [194]:
Y_test.shape

(255,)

**USING THE DECISION TREE CLASSIFIER TO TRAIN THE MODEL**

In [195]:
from sklearn.tree import DecisionTreeClassifier

In [196]:
Model = DecisionTreeClassifier(criterion = "entropy", random_state = 0)

In [197]:
Model = Model.fit(X_train,Y_train)

In [198]:
y_pred = Model.predict(X_test)

In [200]:
from sklearn import metrics

In [201]:
print("Accuracy:",metrics.accuracy_score(Y_test, y_pred))

Accuracy: 0.7490196078431373

In [202]:
Score = Model.score(X_test,Y_test)

In [203]:
print(Score)

0.7490196078431373